---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.IsSummarySectionHidden
source: html/79e785de-d4e7-9a84-ab8c-eece28c42b1f.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.IsSummarySectionHidden Property

True if the user wishes to hide the summary section; setting this value must go through the appropriate update function

## Syntax (C#)
```csharp
public bool IsSummarySectionHidden { get; }
```